In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("dummy variable.csv")

In [3]:
df

         town  area   price
0   Ghaziabad  2600  550000
1   Ghaziabad  3000  565000
2   Ghaziabad  3200  610000
3   Ghaziabad  3600  680000
4   Ghaziabad  4000  725000
5     Mathura  2600  585000
6     Mathura  2800  615000
7     Mathura  3300  650000
8     Mathura  3600  710000
9       Dehli  2600  575000
10      Dehli  2900  600000
11      Dehli  3100  620000
12      Dehli  3600  695000

# To create Dummy variable because we need the seprate the town in integer data

In [4]:
dummies=pd.get_dummies(df["town"])

In [5]:
dummies

    Dehli  Ghaziabad  Mathura
0       0          1        0
1       0          1        0
2       0          1        0
3       0          1        0
4       0          1        0
5       0          0        1
6       0          0        1
7       0          0        1
8       0          0        1
9       1          0        0
10      1          0        0
11      1          0        0
12      1          0        0

## Now concat this dummies data with df data

In [6]:
merged=pd.concat([df,dummies],axis="columns")
merged

         town  area   price  Dehli  Ghaziabad  Mathura
0   Ghaziabad  2600  550000      0          1        0
1   Ghaziabad  3000  565000      0          1        0
2   Ghaziabad  3200  610000      0          1        0
3   Ghaziabad  3600  680000      0          1        0
4   Ghaziabad  4000  725000      0          1        0
5     Mathura  2600  585000      0          0        1
6     Mathura  2800  615000      0          0        1
7     Mathura  3300  650000      0          0        1
8     Mathura  3600  710000      0          0        1
9       Dehli  2600  575000      1          0        0
10      Dehli  2900  600000      1          0        0
11      Dehli  3100  620000      1          0        0
12      Dehli  3600  695000      1          0        0

## Drop the last dummies column and town name because we do not need them to build the algorithm

In [7]:
final=merged.drop(["town","Mathura"],axis="columns")
final

    area   price  Dehli  Ghaziabad
0   2600  550000      0          1
1   3000  565000      0          1
2   3200  610000      0          1
3   3600  680000      0          1
4   4000  725000      0          1
5   2600  585000      0          0
6   2800  615000      0          0
7   3300  650000      0          0
8   3600  710000      0          0
9   2600  575000      1          0
10  2900  600000      1          0
11  3100  620000      1          0
12  3600  695000      1          0

## Now we can build the model for price and area,Dehli,Ghaziabad,Mathura

In [8]:
import matplotlib.pyplot as plt

In [41]:
x=final[["area","Dehli","Ghaziabad"]]
y=final[["price"]]

In [42]:
from sklearn.linear_model import LinearRegression

In [43]:
lm=LinearRegression()

In [44]:
lm.fit(x,y)

LinearRegression()

## Here we see that we have to pass 3 argument to get estimated price of that area in perticular town Here (2600->area) (1->delhi) (0->notghaziabad)
## if we want to predict the price in mathura we have to pass 2600,0,0

In [51]:
lm.predict([[2600,1,0]])

array([[565396.15136531]])

## Now chect the accuray of model

In [52]:
lm.score(x,y)

0.9573929037221871

In [54]:
y_pedi=lm.predict(x)

In [53]:
from sklearn.metrics import mean_squared_error

In [56]:
mean_squared_error(y,y_pedi)

130581926.1366461